In [4]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split,cross_val_score
from sklearn.linear_model import LogisticRegression
import matplotlib.pyplot as plt
import seaborn as sns

#### General Approach without Manipulation

In [9]:
df = pd.read_csv(r"D:\krish naik - udemy ML and Deep Learning\CampusX\Feature Engineering\titanic_train.csv",
                 usecols= ['Age','Pclass','SibSp','Parch','Survived'])
df.sample(5)

     Survived  Pclass   Age  SibSp  Parch
330         1       3   NaN      2      0
756         0       3  28.0      0      0
209         1       1  40.0      0      0
338         1       3  45.0      0      0
152         0       3  55.5      0      0

In [13]:
df.dropna(inplace = True)

In [15]:
X = df.drop(columns='Survived')
y =df['Survived']

In [18]:
np.mean(cross_val_score(LogisticRegression(),X,y,scoring='accuracy',cv = 20))

0.6933333333333332

#### Applying Feature Construction

In [21]:
X['Family_size'] = X['SibSp'] + X['Parch'] + 1
# Adding that person with regards to whom we are checking sibsp and parch

In [23]:
X.sample(5)

     Pclass   Age  SibSp  Parch  Family_size
870       3  26.0      0      0            1
414       3  44.0      0      0            1
319       1  40.0      1      1            3
262       1  52.0      1      1            3
421       3  21.0      0      0            1

In [27]:
def my_func(num):
    if num == 1:
        return 0 # alone
    elif num>1 and num<5:
        return 1 # small family
    else:
        return 2 # large family

In [31]:
X['Family_type'] = X['Family_size'].apply(my_func)

In [39]:
X.sample(10)

     Pclass   Age  SibSp  Parch  Family_size  Family_type
163       3  17.0      0      0            1            0
278       3   7.0      4      1            6            2
764       3  16.0      0      0            1            0
414       3  44.0      0      0            1            0
473       2  23.0      0      0            1            0
322       2  30.0      0      0            1            0
477       3  29.0      1      0            2            1
683       3  14.0      5      2            8            2
105       3  28.0      0      0            1            0
716       1  38.0      0      0            1            0

In [41]:
X.columns

Index(['Pclass', 'Age', 'SibSp', 'Parch', 'Family_size', 'Family_type'], dtype='object')

In [45]:
X = X.drop(['SibSp', 'Parch', 'Family_size'],axis=1)

In [47]:
X

     Pclass   Age  Family_type
0         3  22.0            1
1         1  38.0            1
2         3  26.0            0
3         1  35.0            1
4         3  35.0            0
..      ...   ...          ...
885       3  39.0            2
886       2  27.0            0
887       1  19.0            0
889       1  26.0            0
890       3  32.0            0

[714 rows x 3 columns]

In [49]:
np.mean(cross_val_score(LogisticRegression(),X,y,scoring='accuracy',cv = 20))

0.7003174603174602

#### Feature Splitting

In [52]:
df = pd.read_csv(r"D:\krish naik - udemy ML and Deep Learning\CampusX\Feature Engineering\titanic_train.csv")
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
57,58,0,3,"Novel, Mr. Mansouer",male,28.5,0,0,2697,7.2292,NaN,C
683,684,0,3,"Goodwin, Mr. Charles Edward",male,14.0,5,2,CA 2144,46.9000,NaN,S
809,810,1,1,"Chambers, Mrs. Norman Campbell (Bertha Griggs)",female,33.0,1,0,113806,53.1000,E8,S
697,698,1,3,"Mullens, Miss. Katherine ""Katie""",female,NaN,0,0,35852,7.7333,NaN,Q
574,575,0,3,"Rush, Mr. Alfred George John",male,16.0,0,0,A/4. 20589,8.0500,NaN,S

In [54]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [62]:
df['Title'] = df['Name'].str.split(', ',expand = True)[1].str.split('. ',expand = True)[0]

In [64]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
69,70,0,3,"Kink, Mr. Vincenz",male,26.0,2,0,315151,8.6625,NaN,S,Mr
853,854,1,1,"Lines, Miss. Mary Conover",female,16.0,0,1,PC 17592,39.4000,D28,S,Miss
716,717,1,1,"Endres, Miss. Caroline Louise",female,38.0,0,0,PC 17757,227.5250,C45,C,Miss
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,Mr
259,260,1,2,"Parrish, Mrs. (Lutie Davis)",female,50.0,0,1,230433,26.0000,NaN,S,Mrs

In [96]:
df.groupby('Title').mean(['Survived'])['Survived'].sort_values(ascending=True)

Title
Capt        0.000000
Don         0.000000
Jonkheer    0.000000
Rev         0.000000
Mr          0.156673
Dr          0.428571
Col         0.500000
Major       0.500000
Master      0.575000
Miss        0.697802
Mrs         0.792000
Mme         1.000000
Sir         1.000000
Ms          1.000000
Lady        1.000000
Mlle        1.000000
th          1.000000
Name: Survived, dtype: float64

In [112]:
df['Is_Married'] = 0
df['Is_Married'].loc[df['Title'] == 'Mrs'] = 1

C:\Users\porep\AppData\Local\Temp\ipykernel_15332\2254989826.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Is_Married'].loc[df['Title'] == 'Mrs'] = 1
C:\Users\porep\AppData\Local\Temp\ipykernel_15332\2254989826.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Is_Married'].loc[df['Title'] == 'Mrs'] = 1

In [114]:
df['Is_Married'].value_counts()

Is_Married
0    766
1    125
Name: count, dtype: int64